БИТУправление_медицинским_центром_демо/src/Documents/удалитьУстановкаСкидокНоменклатуры/удалитьУстановкаСкидокНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удалитьУстановкаСкидокНоменклатуры</name>
  <comment>Документ редакции 1.0. Используется для конвертации скидок при  переходе на редакцию 2.0 и выше</comment>
  <registerRecords>InformationRegister.ВремяДействияСкидок</registerRecords>
  <attributes>
    <name>ДатаНачалаСкидки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСкидки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияФильтра</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсейНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехПолучателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДнямНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накопительная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Фильтр</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/РазмерыСкидок/РазмерыСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмерыСкидок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонецИнтервала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накопительная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДнямНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Фильтр</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.КартыСкидок</types>
      <types>CatalogRef.ВидыКартСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/удалитьУстановкаСкидокНоменклатуры/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА.

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Проверка заполения документа.
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("ДатаНачалаСкидки");

	// Вызываем общую процедуру проверки.
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Движения по регистру "Размеры скидок".
	Если ДляВсейНоменклатуры	Тогда
		ДобавитьСтрокуДвиженияПоСкидкам();	
	Иначе	
		Для Каждого ТекСтрокаНоменклатура Из Фильтр Цикл
			ДобавитьСтрокуДвиженияПоСкидкам(ТекСтрокаНоменклатура.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	Если ПоДнямНедели Тогда
		Для Каждого СтрВремяДействия Из ВремяПоДнямНедели Цикл
			Если СтрВремяДействия.Выбран Тогда
				Движение = Движения.ВремяДействияСкидок.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,СтрВремяДействия);
				Движение.Период = Дата;
				Движение.Регистратор = Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		флЗаписать = Ложь;
		Если Накопительная И Скидка <> 0 Тогда
			Скидка = 0;
			флЗаписать = Истина;
		КонецЕсли;
		
		Если ДляВсейНоменклатуры И Фильтр.Количество() <> 0 Тогда
			Фильтр.Очистить();
			флЗаписать = Истина;
		КонецЕсли;
		
		Если флЗаписать Тогда
			Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуДвиженияПоСкидкам(Номенклатура = Неопределено)
	Движение = Движения.РазмерыСкидок.Добавить();
	Движение.Регистратор     = Ссылка;
	Движение.Период			 = ДатаНачалаСкидки;
	Движение.КонецИнтервала  = ДатаОкончанияСкидки;
	Движение.Фильтр          = ?(ЗначениеЗаполнено(ЗначенияФильтра),ЗначенияФильтра,Неопределено);
	Движение.Номенклатура    = Номенклатура;
	Движение.ПроцентСкидки   = Скидка;	
	Движение.Накопительная   = Накопительная;
	Движение.ПоДнямНедели    = ПоДнямНедели;
КонецПроцедуры

#КонецОбласти
